workstation/openfoam-master-tutorials/tutorials/heatTransfer/chtMultiRegionFoam/solarBeamWithTrees/system/solid/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        solid_to_domain3
        {
            type        patch;
        }
    }
    T
    {
        internalField   uniform 300;

        boundaryField
        {
            solid_to_air
            {
                type            compressible::turbulentTemperatureRadCoupledMixed;
                Tnbr            T;
                kappaMethod     solidThermo;
                qrNbr           qr;
                qr              none;
                kappa           none;
                thermalInertia  true;
                value           uniform 300;
            }

            solid_to_floor
            {
                type            compressible::turbulentTemperatureRadCoupledMixed;
                Tnbr            T;
                kappaMethod     solidThermo;
                qrNbr           none;
                qr              none;
                kappa           none;
                thermalInertia  true;
                value           uniform 300;
            }

            solid_to_domain3
            {
                type            fixedValue;
                value           uniform 300.0;
            }
        }
    }
}


// ************************************************************************* //
